package org.example;

public class Lesson_2 {
    public static void main(String[] args) {
        System.out.println();
        /*
        Добрый день, Сергей!
    Что было сделано с 19.09 :

    1) Изучена методичка. Из нее, по представленному коду, попробовал работать с классом Path, Files .
    2) Пробежался по вашему коду урока (перепечатал, так как в процессе лучше понимается что от чего и как работает).
    3) Погрузился в документацию, для изучения определенных методов: как работают, какая структура.
    4) Дополнительно изучаю информацию в интернете по NIO, т.к. вопросы есть, но их сложно собрать и корректно сформулировать. Хоть Вы и говорили, особо не углубляться в NIO.

         */
    }
}
