package org.example;

public class Main {
    public static void main(String[] args) {
     /*  1) Как организовать клиент-серверное взаимодействие?
          Организовать можно следующими подходами:
          java.io ServerSocket/Socket;
          java.nio ServerSocketChannel/SocketChannel;
          Java фреймворк Netty.

          2) Как и в каком виде передавать файлы?
          В виде простого потока байтов;
          Придумать и реализовать свой протокол передачи;
          Передавать сериализованные объекты, содержащие
          информацию о файлах;
          Как параллельно с файлами передавать служебные
          сообщения/команды, в отдельном сетевом потоке;

          3) Как пересылать большие файлы?
          Архивами, не более 2ГБ размером в каждом файле

          4) Как пересылать служебные команды?
          5) Что хранить в базе данных?
          6) Как передавать структуру каталогов/файлов?
          7) Какую библиотеку использовать для сетевого взаимодействия: java.io, java.nio, Netty?
    */
    }
}
